app/controllers/wenwer_controller.rb

INSERT INTO "events" ("category", "created_at", "date", "image", "location", "name", "time", "updated_at", "url", "venue") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def input_event

    event = params["event"]
    a = Event.new

    a.category = event[:category]
    a.name = event[:name]
    a.date = event[:date]
    a.venue = event[:venue]
    a.image = event[:image]
    a.url = event[:url]

    a.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
---
  def detail

    @event = Event.find(params[:id])

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 5]]
---
  def delete

    a = Event.find(params[:id])
    a.destroy

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "events" SET "category" = '', "name" = 'Biggest', "venue" = '', "image" = '', "updated_at" = '2012-07-21 22:19:16.104797' WHERE "events"."id" = 2
---
  def update


    a = Event.find(params[:id])

    a.category = params[:category]
    a.name = params[:name]
    a.date = params[:date]
    a.venue = params[:venue]
    a.image = params[:image]
    a.url = params[:url]

    a.save